HW3/Stress testing/dynamic_test.txt
Running 3s test @ http://localhost:8000/
  6 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.02ms   54.61ms   1.67s    99.38%
    Req/Sec     3.40k     2.97k   10.04k    62.60%
  42209 requests in 3.03s, 9.02MB read
  Socket errors: connect 3983, read 0, write 0, timeout 0
Requests/sec:  13908.22
Transfer/sec:      2.97MB