HW3/Stress testing/proxy_test.txt
Running 8s test @ http://localhost/api/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.03ms   65.61ms   1.90s    99.29%
    Req/Sec     1.97k     1.10k    5.20k    67.23%
  105341 requests in 8.05s, 24.71MB read
  Socket errors: connect 3987, read 1840, write 0, timeout 141
Requests/sec:  13083.11
Transfer/sec:      3.07MB